0xsmirk/mcu_cmsis_svd/Spansion/MB9BF36xx.svd
        <!-- REGISTER "TTC_PSR" -->
        <register>
          <name>TTC_PSR</name>
          <description> register TTC_PSR </description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TTC" -->
            <field>
              <name>TTC</name>
              <description> bitfield TTC </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSW_TMR" -->
        <register>
          <name>CSW_TMR</name>
          <description> register CSW_TMR </description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SOWT" -->
            <field>
              <name>SOWT</name>
              <description> bitfield SOWT </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOWT" -->
            <field>
              <name>MOWT</name>
              <description> bitfield MOWT </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PSW_TMR" -->
        <register>
          <name>PSW_TMR</name>
          <description> register PSW_TMR </description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x17</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PINC" -->
            <field>
              <name>PINC</name>
              <description> bitfield PINC </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "POWT" -->
            <field>
              <name>POWT</name>
              <description> bitfield POWT </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PLL_CTL1" -->
        <register>
          <name>PLL_CTL1</name>
          <description> register PLL_CTL1 </description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PLLK" -->
            <field>
              <name>PLLK</name>
              <description> bitfield PLLK </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLM" -->
            <field>
              <name>PLLM</name>
              <description> bitfield PLLM </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PLL_CTL2" -->
        <register>
          <name>PLL_CTL2</name>
          <description> register PLL_CTL2 </description>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PLLN" -->
            <field>
              <name>PLLN</name>
              <description> bitfield PLLN </description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DBWDT_CTL" -->
        <register>
          <name>DBWDT_CTL</name>
          <description> register DBWDT_CTL </description>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xA0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DPHWBE" -->
            <field>
              <name>DPHWBE</name>
              <description> bitfield DPHWBE </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DPSWBE" -->
            <field>
              <name>DPSWBE</name>
              <description> bitfield DPSWBE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INT_ENR" -->
        <register>
          <name>INT_ENR</name>
          <description> register INT_ENR </description>
          <addressOffset>0x60</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x27</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSE" -->
            <field>
              <name>FCSE</name>
              <description> bitfield FCSE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCSE" -->
            <field>
              <name>PCSE</name>
              <description> bitfield PCSE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCSE" -->
            <field>
              <name>SCSE</name>
              <description> bitfield SCSE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCSE" -->
            <field>
              <name>MCSE</name>
              <description> bitfield MCSE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INT_STR" -->
        <register>
          <name>INT_STR</name>
          <description> register INT_STR </description>
          <addressOffset>0x64</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x27</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSI" -->
            <field>
              <name>FCSI</name>
              <description> bitfield FCSI </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PCSI" -->
            <field>
              <name>PCSI</name>
              <description> bitfield PCSI </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SCSI" -->
            <field>
              <name>SCSI</name>
              <description> bitfield SCSI </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MCSI" -->
            <field>
              <name>MCSI</name>
              <description> bitfield MCSI </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INT_CLR" -->
        <register>
          <name>INT_CLR</name>
          <description> register INT_CLR </description>
          <addressOffset>0x68</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x27</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSC" -->
            <field>
              <name>FCSC</name>
              <description> bitfield FCSC </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "PCSC" -->
            <field>
              <name>PCSC</name>
              <description> bitfield PCSC </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SCSC" -->
            <field>
              <name>SCSC</name>
              <description> bitfield SCSC </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "MCSC" -->
            <field>
              <name>MCSC</name>
              <description> bitfield MCSC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
