0xsmirk/mcu_cmsis_svd/Spansion/MB9BF36xx.svd
        <!-- REGISTER "TIMER2INTCLR" -->
        <register derivedFrom="TIMER1INTCLR">
          <name>TIMER2INTCLR</name>
          <description> register TIMER2INTCLR </description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <!-- REGISTER "TIMER2RIS" -->
        <register derivedFrom="TIMER1RIS">
          <name>TIMER2RIS</name>
          <description> register TIMER2RIS </description>
          <addressOffset>0x30</addressOffset>
        </register>
        <!-- REGISTER "TIMER2MIS" -->
        <register derivedFrom="TIMER1MIS">
          <name>TIMER2MIS</name>
          <description> register TIMER2MIS </description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "TIMER2BGLOAD" -->
        <register derivedFrom="TIMER1BGLOAD">
          <name>TIMER2BGLOAD</name>
          <description> register TIMER2BGLOAD </description>
          <addressOffset>0x38</addressOffset>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFT0" -->
    <peripheral>
      <name>MFT0</name>
      <description> peripheral MFT0 </description>
      <groupName>MFT0</groupName>
      <baseAddress>0x40020000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1EC</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "WFG0_DTIF0" -->
      <interrupt>
        <name>WFG0_DTIF0</name>
        <value>21</value>
      </interrupt>
      <!-- INTERRUPT "FRT0_PEAK" -->
      <interrupt>
        <name>FRT0_PEAK</name>
        <value>24</value>
      </interrupt>
      <!-- INTERRUPT "FRT0_ZERO" -->
      <interrupt>
        <name>FRT0_ZERO</name>
        <value>25</value>
      </interrupt>
      <!-- INTERRUPT "ICU0" -->
      <interrupt>
        <name>ICU0</name>
        <value>26</value>
      </interrupt>
      <!-- INTERRUPT "OCU0" -->
      <interrupt>
        <name>OCU0</name>
        <value>27</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "FRT_TCCP0" -->
        <register>
          <name>FRT_TCCP0</name>
          <description> register FRT_TCCP0 </description>
          <addressOffset>0x142</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "FRT_TCDT0" -->
        <register>
          <name>FRT_TCDT0</name>
          <description> register FRT_TCDT0 </description>
          <addressOffset>0x146</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "FRT_TCSA0" -->
        <register>
          <name>FRT_TCSA0</name>
          <description> register FRT_TCSA0 </description>
          <addressOffset>0x148</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0040</resetValue>
          <resetMask>0xE3FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLK" -->
            <field>
              <name>CLK</name>
              <description> bitfield CLK </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCLR" -->
            <field>
              <name>SCLR</name>
              <description> bitfield SCLR </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "MODE" -->
            <field>
              <name>MODE</name>
              <description> bitfield MODE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STOP" -->
            <field>
              <name>STOP</name>
              <description> bitfield STOP </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BFE" -->
            <field>
              <name>BFE</name>
              <description> bitfield BFE </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICRE" -->
            <field>
              <name>ICRE</name>
              <description> bitfield ICRE </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICLR" -->
            <field>
              <name>ICLR</name>
              <description> bitfield ICLR </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQZE" -->
            <field>
              <name>IRQZE</name>
              <description> bitfield IRQZE </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQZF" -->
            <field>
              <name>IRQZF</name>
              <description> bitfield IRQZF </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECKE" -->
            <field>
              <name>ECKE</name>
              <description> bitfield ECKE </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FRT_TCSC0" -->
        <register>
          <name>FRT_TCSC0</name>
          <description> register FRT_TCSC0 </description>
          <addressOffset>0x14B</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSPC" -->
            <field>
              <name>MSPC</name>
              <description> bitfield MSPC </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSZC" -->
            <field>
              <name>MSZC</name>
              <description> bitfield MSZC </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSPI" -->
            <field>
              <name>MSPI</name>
              <description> bitfield MSPI </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSZI" -->
            <field>
              <name>MSZI</name>
              <description> bitfield MSZI </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FRT_TCCP1" -->
        <register derivedFrom="FRT_TCCP0">
          <name>FRT_TCCP1</name>
          <description> register FRT_TCCP1 </description>
          <addressOffset>0x14E</addressOffset>
        </register>
