0xsmirk/mcu_cmsis_svd/Spansion/MB9BF36xx.svd
        <!-- REGISTER "PCIS" -->
        <register>
          <name>PCIS</name>
          <description> register PCIS </description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P2A" -->
            <field>
              <name>P2A</name>
              <description> bitfield P2A </description>
              <lsb>3</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1A" -->
            <field>
              <name>P1A</name>
              <description> bitfield P1A </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CMPCR" -->
        <register>
          <name>CMPCR</name>
          <description> register CMPCR </description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMPEN" -->
            <field>
              <name>CMPEN</name>
              <description> bitfield CMPEN </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMD1" -->
            <field>
              <name>CMD1</name>
              <description> bitfield CMD1 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMD0" -->
            <field>
              <name>CMD0</name>
              <description> bitfield CMD0 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CCH" -->
            <field>
              <name>CCH</name>
              <description> bitfield CCH </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CMPD" -->
        <register>
          <name>CMPD</name>
          <description> register CMPD </description>
          <addressOffset>0x26</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFC0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMAD" -->
            <field>
              <name>CMAD</name>
              <description> bitfield CMAD </description>
              <lsb>6</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADSS3" -->
        <register>
          <name>ADSS3</name>
          <description> register ADSS3 </description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TS31" -->
            <field>
              <name>TS31</name>
              <description> bitfield TS31 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS30" -->
            <field>
              <name>TS30</name>
              <description> bitfield TS30 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS29" -->
            <field>
              <name>TS29</name>
              <description> bitfield TS29 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS28" -->
            <field>
              <name>TS28</name>
              <description> bitfield TS28 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS27" -->
            <field>
              <name>TS27</name>
              <description> bitfield TS27 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS26" -->
            <field>
              <name>TS26</name>
              <description> bitfield TS26 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS25" -->
            <field>
              <name>TS25</name>
              <description> bitfield TS25 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS24" -->
            <field>
              <name>TS24</name>
              <description> bitfield TS24 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADSS2" -->
        <register>
          <name>ADSS2</name>
          <description> register ADSS2 </description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TS23" -->
            <field>
              <name>TS23</name>
              <description> bitfield TS23 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS22" -->
            <field>
              <name>TS22</name>
              <description> bitfield TS22 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS21" -->
            <field>
              <name>TS21</name>
              <description> bitfield TS21 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS20" -->
            <field>
              <name>TS20</name>
              <description> bitfield TS20 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS19" -->
            <field>
              <name>TS19</name>
              <description> bitfield TS19 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS18" -->
            <field>
              <name>TS18</name>
              <description> bitfield TS18 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS17" -->
            <field>
              <name>TS17</name>
              <description> bitfield TS17 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS16" -->
            <field>
              <name>TS16</name>
              <description> bitfield TS16 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADSS1" -->
        <register>
          <name>ADSS1</name>
          <description> register ADSS1 </description>
          <addressOffset>0x2D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TS15" -->
            <field>
              <name>TS15</name>
              <description> bitfield TS15 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS14" -->
            <field>
              <name>TS14</name>
              <description> bitfield TS14 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS13" -->
            <field>
              <name>TS13</name>
              <description> bitfield TS13 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS12" -->
            <field>
              <name>TS12</name>
              <description> bitfield TS12 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS11" -->
            <field>
              <name>TS11</name>
              <description> bitfield TS11 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS10" -->
            <field>
              <name>TS10</name>
              <description> bitfield TS10 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS9" -->
            <field>
              <name>TS9</name>
              <description> bitfield TS9 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS8" -->
            <field>
              <name>TS8</name>
              <description> bitfield TS8 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADSS0" -->
        <register>
          <name>ADSS0</name>
          <description> register ADSS0 </description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TS7" -->
            <field>
              <name>TS7</name>
              <description> bitfield TS7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS6" -->
            <field>
              <name>TS6</name>
              <description> bitfield TS6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS5" -->
            <field>
              <name>TS5</name>
              <description> bitfield TS5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS4" -->
            <field>
              <name>TS4</name>
              <description> bitfield TS4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS3" -->
            <field>
              <name>TS3</name>
              <description> bitfield TS3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS2" -->
            <field>
              <name>TS2</name>
              <description> bitfield TS2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS1" -->
            <field>
              <name>TS1</name>
              <description> bitfield TS1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS0" -->
            <field>
              <name>TS0</name>
              <description> bitfield TS0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
