0xsmirk/mcu_cmsis_svd/Spansion/MB9BF36xx.svd
        <!-- REGISTER "IRQ007MON" -->
        <register>
          <name>IRQ007MON</name>
          <description> register IRQ007MON </description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQBIT7" -->
            <field>
              <name>IRQBIT7</name>
              <description> bitfield IRQBIT7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT6" -->
            <field>
              <name>IRQBIT6</name>
              <description> bitfield IRQBIT6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT5" -->
            <field>
              <name>IRQBIT5</name>
              <description> bitfield IRQBIT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT4" -->
            <field>
              <name>IRQBIT4</name>
              <description> bitfield IRQBIT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT3" -->
            <field>
              <name>IRQBIT3</name>
              <description> bitfield IRQBIT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT2" -->
            <field>
              <name>IRQBIT2</name>
              <description> bitfield IRQBIT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT1" -->
            <field>
              <name>IRQBIT1</name>
              <description> bitfield IRQBIT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT0" -->
            <field>
              <name>IRQBIT0</name>
              <description> bitfield IRQBIT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ008MON" -->
        <register>
          <name>IRQ008MON</name>
          <description> register IRQ008MON </description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQBIT7" -->
            <field>
              <name>IRQBIT7</name>
              <description> bitfield IRQBIT7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT6" -->
            <field>
              <name>IRQBIT6</name>
              <description> bitfield IRQBIT6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT5" -->
            <field>
              <name>IRQBIT5</name>
              <description> bitfield IRQBIT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT4" -->
            <field>
              <name>IRQBIT4</name>
              <description> bitfield IRQBIT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT3" -->
            <field>
              <name>IRQBIT3</name>
              <description> bitfield IRQBIT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT2" -->
            <field>
              <name>IRQBIT2</name>
              <description> bitfield IRQBIT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT1" -->
            <field>
              <name>IRQBIT1</name>
              <description> bitfield IRQBIT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT0" -->
            <field>
              <name>IRQBIT0</name>
              <description> bitfield IRQBIT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ009MON" -->
        <register>
          <name>IRQ009MON</name>
          <description> register IRQ009MON </description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQBIT7" -->
            <field>
              <name>IRQBIT7</name>
              <description> bitfield IRQBIT7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT6" -->
            <field>
              <name>IRQBIT6</name>
              <description> bitfield IRQBIT6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT5" -->
            <field>
              <name>IRQBIT5</name>
              <description> bitfield IRQBIT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT4" -->
            <field>
              <name>IRQBIT4</name>
              <description> bitfield IRQBIT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT3" -->
            <field>
              <name>IRQBIT3</name>
              <description> bitfield IRQBIT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT2" -->
            <field>
              <name>IRQBIT2</name>
              <description> bitfield IRQBIT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT1" -->
            <field>
              <name>IRQBIT1</name>
              <description> bitfield IRQBIT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT0" -->
            <field>
              <name>IRQBIT0</name>
              <description> bitfield IRQBIT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ010MON" -->
        <register>
          <name>IRQ010MON</name>
          <description> register IRQ010MON </description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQBIT7" -->
            <field>
              <name>IRQBIT7</name>
              <description> bitfield IRQBIT7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT6" -->
            <field>
              <name>IRQBIT6</name>
              <description> bitfield IRQBIT6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT5" -->
            <field>
              <name>IRQBIT5</name>
              <description> bitfield IRQBIT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT4" -->
            <field>
              <name>IRQBIT4</name>
              <description> bitfield IRQBIT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT3" -->
            <field>
              <name>IRQBIT3</name>
              <description> bitfield IRQBIT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT2" -->
            <field>
              <name>IRQBIT2</name>
              <description> bitfield IRQBIT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT1" -->
            <field>
              <name>IRQBIT1</name>
              <description> bitfield IRQBIT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT0" -->
            <field>
              <name>IRQBIT0</name>
              <description> bitfield IRQBIT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
