0xsmirk/mcu_cmsis_svd/Spansion/MB9BF36xx.svd
    <!-- PERIPHERAL "MFS7" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS7</name>
      <baseAddress>0x40038700</baseAddress>
      <!-- INTERRUPT "MFS7_RX" -->
      <interrupt>
        <name>MFS7_RX</name>
        <value>74</value>
      </interrupt>
      <!-- INTERRUPT "MFS7_TX" -->
      <interrupt>
        <name>MFS7_TX</name>
        <value>75</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS8" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS8</name>
      <baseAddress>0x40038800</baseAddress>
      <!-- INTERRUPT "MFS8_RX" -->
      <interrupt>
        <name>MFS8_RX</name>
        <value>103</value>
      </interrupt>
      <!-- INTERRUPT "MFS8_TX" -->
      <interrupt>
        <name>MFS8_TX</name>
        <value>104</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS9" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS9</name>
      <baseAddress>0x40038900</baseAddress>
      <!-- INTERRUPT "MFS9_RX" -->
      <interrupt>
        <name>MFS9_RX</name>
        <value>105</value>
      </interrupt>
      <!-- INTERRUPT "MFS9_TX" -->
      <interrupt>
        <name>MFS9_TX</name>
        <value>106</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS10" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS10</name>
      <baseAddress>0x40038A00</baseAddress>
      <!-- INTERRUPT "MFS10_RX" -->
      <interrupt>
        <name>MFS10_RX</name>
        <value>107</value>
      </interrupt>
      <!-- INTERRUPT "MFS10_TX" -->
      <interrupt>
        <name>MFS10_TX</name>
        <value>108</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS11" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS11</name>
      <baseAddress>0x40038B00</baseAddress>
      <!-- INTERRUPT "MFS11_RX" -->
      <interrupt>
        <name>MFS11_RX</name>
        <value>109</value>
      </interrupt>
      <!-- INTERRUPT "MFS11_TX" -->
      <interrupt>
        <name>MFS11_TX</name>
        <value>110</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS12" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS12</name>
      <baseAddress>0x40038C00</baseAddress>
      <!-- INTERRUPT "MFS12_RX" -->
      <interrupt>
        <name>MFS12_RX</name>
        <value>120</value>
      </interrupt>
      <!-- INTERRUPT "MFS12_TX" -->
      <interrupt>
        <name>MFS12_TX</name>
        <value>121</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS13" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS13</name>
      <baseAddress>0x40038D00</baseAddress>
      <!-- INTERRUPT "MFS13_RX" -->
      <interrupt>
        <name>MFS13_RX</name>
        <value>122</value>
      </interrupt>
      <!-- INTERRUPT "MFS13_TX" -->
      <interrupt>
        <name>MFS13_TX</name>
        <value>123</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS14" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS14</name>
      <baseAddress>0x40038E00</baseAddress>
      <!-- INTERRUPT "MFS14_RX" -->
      <interrupt>
        <name>MFS14_RX</name>
        <value>124</value>
      </interrupt>
      <!-- INTERRUPT "MFS14_TX" -->
      <interrupt>
        <name>MFS14_TX</name>
        <value>125</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS15" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS15</name>
      <baseAddress>0x40038F00</baseAddress>
      <!-- INTERRUPT "MFS15_RX" -->
      <interrupt>
        <name>MFS15_RX</name>
        <value>126</value>
      </interrupt>
      <!-- INTERRUPT "MFS15_TX" -->
      <interrupt>
        <name>MFS15_TX</name>
        <value>127</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "CRC" -->
    <peripheral>
      <name>CRC</name>
      <description> peripheral CRC </description>
      <groupName>CRC</groupName>
      <baseAddress>0x40039000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CRCCR" -->
        <register>
          <name>CRCCR</name>
          <description> register CRCCR </description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FXOR" -->
            <field>
              <name>FXOR</name>
              <description> bitfield FXOR </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRCLSF" -->
            <field>
              <name>CRCLSF</name>
              <description> bitfield CRCLSF </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRCLTE" -->
            <field>
              <name>CRCLTE</name>
              <description> bitfield CRCLTE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LSBFST" -->
            <field>
              <name>LSBFST</name>
              <description> bitfield LSBFST </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LTLEND" -->
            <field>
              <name>LTLEND</name>
              <description> bitfield LTLEND </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRC32" -->
            <field>
              <name>CRC32</name>
              <description> bitfield CRC32 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INIT" -->
            <field>
              <name>INIT</name>
              <description> bitfield INIT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRCINIT" -->
        <register>
          <name>CRCINIT</name>
          <description> register CRCINIT </description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description> bitfield D </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRCIN" -->
        <register>
          <name>CRCIN</name>
          <description> register CRCIN </description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description> bitfield D </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRCR" -->
        <register>
          <name>CRCR</name>
          <description> register CRCR </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description> bitfield D </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
