0xsmirk/mcu_cmsis_svd/Spansion/MB9BF36xx.svd
        <!-- REGISTER "BREG53" -->
        <register>
          <name>BREG53</name>
          <description> register BREG53 </description>
          <addressOffset>0x253</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG54" -->
        <register>
          <name>BREG54</name>
          <description> register BREG54 </description>
          <addressOffset>0x254</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG55" -->
        <register>
          <name>BREG55</name>
          <description> register BREG55 </description>
          <addressOffset>0x255</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG56" -->
        <register>
          <name>BREG56</name>
          <description> register BREG56 </description>
          <addressOffset>0x256</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG57" -->
        <register>
          <name>BREG57</name>
          <description> register BREG57 </description>
          <addressOffset>0x257</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG58" -->
        <register>
          <name>BREG58</name>
          <description> register BREG58 </description>
          <addressOffset>0x258</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG59" -->
        <register>
          <name>BREG59</name>
          <description> register BREG59 </description>
          <addressOffset>0x259</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5A" -->
        <register>
          <name>BREG5A</name>
          <description> register BREG5A </description>
          <addressOffset>0x25A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5B" -->
        <register>
          <name>BREG5B</name>
          <description> register BREG5B </description>
          <addressOffset>0x25B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5C" -->
        <register>
          <name>BREG5C</name>
          <description> register BREG5C </description>
          <addressOffset>0x25C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5D" -->
        <register>
          <name>BREG5D</name>
          <description> register BREG5D </description>
          <addressOffset>0x25D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5E" -->
        <register>
          <name>BREG5E</name>
          <description> register BREG5E </description>
          <addressOffset>0x25E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5F" -->
        <register>
          <name>BREG5F</name>
          <description> register BREG5F </description>
          <addressOffset>0x25F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG60" -->
        <register>
          <name>BREG60</name>
          <description> register BREG60 </description>
          <addressOffset>0x260</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG61" -->
        <register>
          <name>BREG61</name>
          <description> register BREG61 </description>
          <addressOffset>0x261</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG62" -->
        <register>
          <name>BREG62</name>
          <description> register BREG62 </description>
          <addressOffset>0x262</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG63" -->
        <register>
          <name>BREG63</name>
          <description> register BREG63 </description>
          <addressOffset>0x263</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG64" -->
        <register>
          <name>BREG64</name>
          <description> register BREG64 </description>
          <addressOffset>0x264</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
