0xsmirk/mcu_cmsis_svd/Spansion/MB9BF36xx.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "PLL_CONTROL" -->
    <peripheral>
      <name>PLL_CONTROL</name>
      <description> peripheral PLL_CONTROL </description>
      <groupName>PLL_CONTROL</groupName>
      <baseAddress>0x4003C800</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "SSCTL1" -->
        <register>
          <name>SSCTL1</name>
          <description> register SSCTL1 </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000031</resetMask>
        </register>
        <!-- REGISTER "SSCTL2" -->
        <register>
          <name>SSCTL2</name>
          <description> register SSCTL2 </description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "EXBUS" -->
    <peripheral>
      <name>EXBUS</name>
      <description> peripheral EXBUS </description>
      <groupName>EXBUS</groupName>
      <baseAddress>0x4003F000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x300</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "EXTBUS_ERR" -->
      <interrupt>
        <name>EXTBUS_ERR</name>
        <value>49</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "MODE0" -->
        <register>
          <name>MODE0</name>
          <description> register MODE0 </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3BFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MOEXEUP" -->
            <field>
              <name>MOEXEUP</name>
              <description> bitfield MOEXEUP </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPXCSOF" -->
            <field>
              <name>MPXCSOF</name>
              <description> bitfield MPXCSOF </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPXDOFF" -->
            <field>
              <name>MPXDOFF</name>
              <description> bitfield MPXDOFF </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ALEINV" -->
            <field>
              <name>ALEINV</name>
              <description> bitfield ALEINV </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPXMODE" -->
            <field>
              <name>MPXMODE</name>
              <description> bitfield MPXMODE </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SHRTDOUT" -->
            <field>
              <name>SHRTDOUT</name>
              <description> bitfield SHRTDOUT </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description> bitfield RDY </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAGE" -->
            <field>
              <name>PAGE</name>
              <description> bitfield PAGE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NAND" -->
            <field>
              <name>NAND</name>
              <description> bitfield NAND </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WEOFF" -->
            <field>
              <name>WEOFF</name>
              <description> bitfield WEOFF </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RBMON" -->
            <field>
              <name>RBMON</name>
              <description> bitfield RBMON </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WDTH" -->
            <field>
              <name>WDTH</name>
              <description> bitfield WDTH </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MODE1" -->
        <register derivedFrom="MODE0">
          <name>MODE1</name>
          <description> register MODE1 </description>
          <addressOffset>0x4</addressOffset>
        </register>
        <!-- REGISTER "MODE2" -->
        <register derivedFrom="MODE0">
          <name>MODE2</name>
          <description> register MODE2 </description>
          <addressOffset>0x8</addressOffset>
        </register>
