0xsmirk/mcu_cmsis_svd/Spansion/MB9BF36xx.svd
        <!-- REGISTER "ATIM3" -->
        <register derivedFrom="ATIM0">
          <name>ATIM3</name>
          <description> register ATIM3 </description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "ATIM4" -->
        <register derivedFrom="ATIM0">
          <name>ATIM4</name>
          <description> register ATIM4 </description>
          <addressOffset>0x70</addressOffset>
        </register>
        <!-- REGISTER "ATIM5" -->
        <register derivedFrom="ATIM0">
          <name>ATIM5</name>
          <description> register ATIM5 </description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "ATIM6" -->
        <register derivedFrom="ATIM0">
          <name>ATIM6</name>
          <description> register ATIM6 </description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "ATIM7" -->
        <register derivedFrom="ATIM0">
          <name>ATIM7</name>
          <description> register ATIM7 </description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "SMODE" -->
        <register>
          <name>SMODE</name>
          <description> register SMODE </description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001300</resetValue>
          <resetMask>0x0001FF37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSDCLKOFF" -->
            <field>
              <name>MSDCLKOFF</name>
              <description> bitfield MSDCLKOFF </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BASEL" -->
            <field>
              <name>BASEL</name>
              <description> bitfield BASEL </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RASEL" -->
            <field>
              <name>RASEL</name>
              <description> bitfield RASEL </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CASEL" -->
            <field>
              <name>CASEL</name>
              <description> bitfield CASEL </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ROFF" -->
            <field>
              <name>ROFF</name>
              <description> bitfield ROFF </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PDON" -->
            <field>
              <name>PDON</name>
              <description> bitfield PDON </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDON" -->
            <field>
              <name>SDON</name>
              <description> bitfield SDON </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "REFTIM" -->
        <register>
          <name>REFTIM</name>
          <description> register REFTIM </description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000033</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PREF" -->
            <field>
              <name>PREF</name>
              <description> bitfield PREF </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NREF" -->
            <field>
              <name>NREF</name>
              <description> bitfield NREF </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REFC" -->
            <field>
              <name>REFC</name>
              <description> bitfield REFC </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWRDWN" -->
        <register>
          <name>PWRDWN</name>
          <description> register PWRDWN </description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PDC" -->
            <field>
              <name>PDC</name>
              <description> bitfield PDC </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SDTIM" -->
        <register>
          <name>SDTIM</name>
          <description> register SDTIM </description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00420000</resetValue>
          <resetMask>0x03FFFFF3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TDPL" -->
            <field>
              <name>TDPL</name>
              <description> bitfield TDPL </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TREFC" -->
            <field>
              <name>TREFC</name>
              <description> bitfield TREFC </description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRAS" -->
            <field>
              <name>TRAS</name>
              <description> bitfield TRAS </description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRCD" -->
            <field>
              <name>TRCD</name>
              <description> bitfield TRCD </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRP" -->
            <field>
              <name>TRP</name>
              <description> bitfield TRP </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRC" -->
            <field>
              <name>TRC</name>
              <description> bitfield TRC </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CL" -->
            <field>
              <name>CL</name>
              <description> bitfield CL </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SDCMD" -->
        <register>
          <name>SDCMD</name>
          <description> register SDCMD </description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x801FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PEND" -->
            <field>
              <name>PEND</name>
              <description> bitfield PEND </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SDCKE" -->
            <field>
              <name>SDCKE</name>
              <description> bitfield SDCKE </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCS" -->
            <field>
              <name>SDCS</name>
              <description> bitfield SDCS </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDRAS" -->
            <field>
              <name>SDRAS</name>
              <description> bitfield SDRAS </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCAS" -->
            <field>
              <name>SDCAS</name>
              <description> bitfield SDCAS </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDWE" -->
            <field>
              <name>SDWE</name>
              <description> bitfield SDWE </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDAD" -->
            <field>
              <name>SDAD</name>
              <description> bitfield SDAD </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MEMCERR" -->
        <register>
          <name>MEMCERR</name>
          <description> register MEMCERR </description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDION" -->
            <field>
              <name>SDION</name>
              <description> bitfield SDION </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SFION" -->
            <field>
              <name>SFION</name>
              <description> bitfield SFION </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDER" -->
            <field>
              <name>SDER</name>
              <description> bitfield SDER </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SFER" -->
            <field>
              <name>SFER</name>
              <description> bitfield SFER </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DCLKR" -->
        <register>
          <name>DCLKR</name>
          <description> register DCLKR </description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MCLKON" -->
            <field>
              <name>MCLKON</name>
              <description> bitfield MCLKON </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDIV" -->
            <field>
              <name>MDIV</name>
              <description> bitfield MDIV </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EST" -->
        <register>
          <name>EST</name>
          <description> register EST </description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WERR" -->
            <field>
              <name>WERR</name>
              <description> bitfield WERR </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WEAD" -->
        <register>
          <name>WEAD</name>
          <description> register WEAD </description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description> bitfield ADDR </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
